---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HostTopologyChange
source: html/c5b6cab1-59ab-88af-dd39-721d0ed3bb19.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.HostTopologyChange Property

A reinforced host has undergone a major change. The reinforcement must be removed.

## Syntax (C#)
```csharp
public static FailureDefinitionId HostTopologyChange { get; }
```